SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_rac.h
/* Bit fields for RAC LNAMIXTRIM0 */
#define _RAC_LNAMIXTRIM0_RESETVALUE                                   0x1108233DUL                                        /**< Default value for RAC_LNAMIXTRIM0           */
#define _RAC_LNAMIXTRIM0_MASK                                         0x1FFFFFFFUL                                        /**< Mask for RAC_LNAMIXTRIM0                    */
#define _RAC_LNAMIXTRIM0_LNAMIXCURCTRL_SHIFT                          0                                                   /**< Shift value for RAC_LNAMIXCURCTRL           */
#define _RAC_LNAMIXTRIM0_LNAMIXCURCTRL_MASK                           0x3FUL                                              /**< Bit mask for RAC_LNAMIXCURCTRL              */
#define _RAC_LNAMIXTRIM0_LNAMIXCURCTRL_DEFAULT                        0x0000003DUL                                        /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define RAC_LNAMIXTRIM0_LNAMIXCURCTRL_DEFAULT                         (_RAC_LNAMIXTRIM0_LNAMIXCURCTRL_DEFAULT << 0)       /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */
#define _RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_SHIFT                          6                                                   /**< Shift value for RAC_LNAMIXHIGHCUR           */
#define _RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_MASK                           0xC0UL                                              /**< Bit mask for RAC_LNAMIXHIGHCUR              */
#define _RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_DEFAULT                        0x00000000UL                                        /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define _RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_470uA                  0x00000000UL                                        /**< Mode current_470uA for RAC_LNAMIXTRIM0      */
#define _RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_530uA                  0x00000001UL                                        /**< Mode current_530uA for RAC_LNAMIXTRIM0      */
#define _RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_unused                         0x00000002UL                                        /**< Mode unused for RAC_LNAMIXTRIM0             */
#define _RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_590uA                  0x00000003UL                                        /**< Mode current_590uA for RAC_LNAMIXTRIM0      */
#define RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_DEFAULT                         (_RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_DEFAULT << 6)       /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */
#define RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_470uA                   (_RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_470uA << 6) /**< Shifted mode current_470uA for RAC_LNAMIXTRIM0*/
#define RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_530uA                   (_RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_530uA << 6) /**< Shifted mode current_530uA for RAC_LNAMIXTRIM0*/
#define RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_unused                          (_RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_unused << 6)        /**< Shifted mode unused for RAC_LNAMIXTRIM0     */
#define RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_590uA                   (_RAC_LNAMIXTRIM0_LNAMIXHIGHCUR_current_590uA << 6) /**< Shifted mode current_590uA for RAC_LNAMIXTRIM0*/
#define _RAC_LNAMIXTRIM0_LNAMIXLOWCUR_SHIFT                           8                                                   /**< Shift value for RAC_LNAMIXLOWCUR            */
#define _RAC_LNAMIXTRIM0_LNAMIXLOWCUR_MASK                            0xF00UL                                             /**< Bit mask for RAC_LNAMIXLOWCUR               */
#define _RAC_LNAMIXTRIM0_LNAMIXLOWCUR_DEFAULT                         0x00000003UL                                        /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define RAC_LNAMIXTRIM0_LNAMIXLOWCUR_DEFAULT                          (_RAC_LNAMIXTRIM0_LNAMIXLOWCUR_DEFAULT << 8)        /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDBWSEL_SHIFT                       12                                                  /**< Shift value for RAC_LNAMIXRFPKDBWSEL        */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDBWSEL_MASK                        0x3000UL                                            /**< Bit mask for RAC_LNAMIXRFPKDBWSEL           */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDBWSEL_DEFAULT                     0x00000002UL                                        /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define RAC_LNAMIXTRIM0_LNAMIXRFPKDBWSEL_DEFAULT                      (_RAC_LNAMIXTRIM0_LNAMIXRFPKDBWSEL_DEFAULT << 12)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDCALCM_SHIFT                       14                                                  /**< Shift value for RAC_LNAMIXRFPKDCALCM        */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDCALCM_MASK                        0xFC000UL                                           /**< Bit mask for RAC_LNAMIXRFPKDCALCM           */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDCALCM_DEFAULT                     0x00000020UL                                        /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define RAC_LNAMIXTRIM0_LNAMIXRFPKDCALCM_DEFAULT                      (_RAC_LNAMIXTRIM0_LNAMIXRFPKDCALCM_DEFAULT << 14)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDCALDM_SHIFT                       20                                                  /**< Shift value for RAC_LNAMIXRFPKDCALDM        */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDCALDM_MASK                        0x1F00000UL                                         /**< Bit mask for RAC_LNAMIXRFPKDCALDM           */
#define _RAC_LNAMIXTRIM0_LNAMIXRFPKDCALDM_DEFAULT                     0x00000010UL                                        /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define RAC_LNAMIXTRIM0_LNAMIXRFPKDCALDM_DEFAULT                      (_RAC_LNAMIXTRIM0_LNAMIXRFPKDCALDM_DEFAULT << 20)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */
#define _RAC_LNAMIXTRIM0_LNAMIXTRIMVREG_SHIFT                         25                                                  /**< Shift value for RAC_LNAMIXTRIMVREG          */
#define _RAC_LNAMIXTRIM0_LNAMIXTRIMVREG_MASK                          0x1E000000UL                                        /**< Bit mask for RAC_LNAMIXTRIMVREG             */
#define _RAC_LNAMIXTRIM0_LNAMIXTRIMVREG_DEFAULT                       0x00000008UL                                        /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define RAC_LNAMIXTRIM0_LNAMIXTRIMVREG_DEFAULT                        (_RAC_LNAMIXTRIM0_LNAMIXTRIMVREG_DEFAULT << 25)     /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */

/* Bit fields for RAC LNAMIXTRIM1 */
#define _RAC_LNAMIXTRIM1_RESETVALUE                                   0x00045408UL                                     /**< Default value for RAC_LNAMIXTRIM1           */
#define _RAC_LNAMIXTRIM1_MASK                                         0x0007FFFFUL                                     /**< Mask for RAC_LNAMIXTRIM1                    */
#define _RAC_LNAMIXTRIM1_LNAMIXIBIASADJ_SHIFT                         0                                                /**< Shift value for RAC_LNAMIXIBIASADJ          */
#define _RAC_LNAMIXTRIM1_LNAMIXIBIASADJ_MASK                          0x3FUL                                           /**< Bit mask for RAC_LNAMIXIBIASADJ             */
#define _RAC_LNAMIXTRIM1_LNAMIXIBIASADJ_DEFAULT                       0x00000008UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define RAC_LNAMIXTRIM1_LNAMIXIBIASADJ_DEFAULT                        (_RAC_LNAMIXTRIM1_LNAMIXIBIASADJ_DEFAULT << 0)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */
#define _RAC_LNAMIXTRIM1_LNAMIXLNACAPSEL_SHIFT                        6                                                /**< Shift value for RAC_LNAMIXLNACAPSEL         */
#define _RAC_LNAMIXTRIM1_LNAMIXLNACAPSEL_MASK                         0x1C0UL                                          /**< Bit mask for RAC_LNAMIXLNACAPSEL            */
#define _RAC_LNAMIXTRIM1_LNAMIXLNACAPSEL_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define RAC_LNAMIXTRIM1_LNAMIXLNACAPSEL_DEFAULT                       (_RAC_LNAMIXTRIM1_LNAMIXLNACAPSEL_DEFAULT << 6)  /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_SHIFT                          9                                                /**< Shift value for RAC_LNAMIXMXRBIAS           */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_MASK                           0x600UL                                          /**< Bit mask for RAC_LNAMIXMXRBIAS              */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_DEFAULT                        0x00000002UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_1V                        0x00000000UL                                     /**< Mode bias_1V for RAC_LNAMIXTRIM1            */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_unused                         0x00000001UL                                     /**< Mode unused for RAC_LNAMIXTRIM1             */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_900m                      0x00000002UL                                     /**< Mode bias_900m for RAC_LNAMIXTRIM1          */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_800m                      0x00000003UL                                     /**< Mode bias_800m for RAC_LNAMIXTRIM1          */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_DEFAULT                         (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_DEFAULT << 9)    /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_1V                         (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_1V << 9)    /**< Shifted mode bias_1V for RAC_LNAMIXTRIM1    */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_unused                          (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_unused << 9)     /**< Shifted mode unused for RAC_LNAMIXTRIM1     */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_900m                       (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_900m << 9)  /**< Shifted mode bias_900m for RAC_LNAMIXTRIM1  */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_800m                       (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS_bias_800m << 9)  /**< Shifted mode bias_800m for RAC_LNAMIXTRIM1  */
#define _RAC_LNAMIXTRIM1_LNAMIXNCASADJ_SHIFT                          11                                               /**< Shift value for RAC_LNAMIXNCASADJ           */
#define _RAC_LNAMIXTRIM1_LNAMIXNCASADJ_MASK                           0x1800UL                                         /**< Bit mask for RAC_LNAMIXNCASADJ              */
#define _RAC_LNAMIXTRIM1_LNAMIXNCASADJ_DEFAULT                        0x00000002UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define _RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_1V                        0x00000000UL                                     /**< Mode ncas_1V for RAC_LNAMIXTRIM1            */
#define _RAC_LNAMIXTRIM1_LNAMIXNCASADJ_unused                         0x00000001UL                                     /**< Mode unused for RAC_LNAMIXTRIM1             */
#define _RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_950m                      0x00000002UL                                     /**< Mode ncas_950m for RAC_LNAMIXTRIM1          */
#define _RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_900m                      0x00000003UL                                     /**< Mode ncas_900m for RAC_LNAMIXTRIM1          */
#define RAC_LNAMIXTRIM1_LNAMIXNCASADJ_DEFAULT                         (_RAC_LNAMIXTRIM1_LNAMIXNCASADJ_DEFAULT << 11)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */
#define RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_1V                         (_RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_1V << 11)   /**< Shifted mode ncas_1V for RAC_LNAMIXTRIM1    */
#define RAC_LNAMIXTRIM1_LNAMIXNCASADJ_unused                          (_RAC_LNAMIXTRIM1_LNAMIXNCASADJ_unused << 11)    /**< Shifted mode unused for RAC_LNAMIXTRIM1     */
#define RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_950m                       (_RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_950m << 11) /**< Shifted mode ncas_950m for RAC_LNAMIXTRIM1  */
#define RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_900m                       (_RAC_LNAMIXTRIM1_LNAMIXNCASADJ_ncas_900m << 11) /**< Shifted mode ncas_900m for RAC_LNAMIXTRIM1  */
#define _RAC_LNAMIXTRIM1_LNAMIXPCASADJ_SHIFT                          13                                               /**< Shift value for RAC_LNAMIXPCASADJ           */
#define _RAC_LNAMIXTRIM1_LNAMIXPCASADJ_MASK                           0x6000UL                                         /**< Bit mask for RAC_LNAMIXPCASADJ              */
#define _RAC_LNAMIXTRIM1_LNAMIXPCASADJ_DEFAULT                        0x00000002UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define _RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_250m                      0x00000000UL                                     /**< Mode pcas_250m for RAC_LNAMIXTRIM1          */
#define _RAC_LNAMIXTRIM1_LNAMIXPCASADJ_unused                         0x00000001UL                                     /**< Mode unused for RAC_LNAMIXTRIM1             */
#define _RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_300m                      0x00000002UL                                     /**< Mode pcas_300m for RAC_LNAMIXTRIM1          */
#define _RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_350m                      0x00000003UL                                     /**< Mode pcas_350m for RAC_LNAMIXTRIM1          */
#define RAC_LNAMIXTRIM1_LNAMIXPCASADJ_DEFAULT                         (_RAC_LNAMIXTRIM1_LNAMIXPCASADJ_DEFAULT << 13)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */
#define RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_250m                       (_RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_250m << 13) /**< Shifted mode pcas_250m for RAC_LNAMIXTRIM1  */
#define RAC_LNAMIXTRIM1_LNAMIXPCASADJ_unused                          (_RAC_LNAMIXTRIM1_LNAMIXPCASADJ_unused << 13)    /**< Shifted mode unused for RAC_LNAMIXTRIM1     */
#define RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_300m                       (_RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_300m << 13) /**< Shifted mode pcas_300m for RAC_LNAMIXTRIM1  */
#define RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_350m                       (_RAC_LNAMIXTRIM1_LNAMIXPCASADJ_pcas_350m << 13) /**< Shifted mode pcas_350m for RAC_LNAMIXTRIM1  */
#define _RAC_LNAMIXTRIM1_LNAMIXVOUTADJ_SHIFT                          15                                               /**< Shift value for RAC_LNAMIXVOUTADJ           */
#define _RAC_LNAMIXTRIM1_LNAMIXVOUTADJ_MASK                           0x78000UL                                        /**< Bit mask for RAC_LNAMIXVOUTADJ              */
#define _RAC_LNAMIXTRIM1_LNAMIXVOUTADJ_DEFAULT                        0x00000008UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define RAC_LNAMIXTRIM1_LNAMIXVOUTADJ_DEFAULT                         (_RAC_LNAMIXTRIM1_LNAMIXVOUTADJ_DEFAULT << 15)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */

/* Bit fields for RAC LNAMIXCAL */
#define _RAC_LNAMIXCAL_RESETVALUE                                     0x00000070UL                                      /**< Default value for RAC_LNAMIXCAL             */
#define _RAC_LNAMIXCAL_MASK                                           0x00000077UL                                      /**< Mask for RAC_LNAMIXCAL                      */
#define RAC_LNAMIXCAL_LNAMIXCALEN                                     (0x1UL << 0)                                      /**< LNAMIXCALEN                                 */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_SHIFT                              0                                                 /**< Shift value for RAC_LNAMIXCALEN             */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_MASK                               0x1UL                                             /**< Bit mask for RAC_LNAMIXCALEN                */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_DEFAULT                            0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_cal_disable                        0x00000000UL                                      /**< Mode cal_disable for RAC_LNAMIXCAL          */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_cal_enable                         0x00000001UL                                      /**< Mode cal_enable for RAC_LNAMIXCAL           */
#define RAC_LNAMIXCAL_LNAMIXCALEN_DEFAULT                             (_RAC_LNAMIXCAL_LNAMIXCALEN_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXCALEN_cal_disable                         (_RAC_LNAMIXCAL_LNAMIXCALEN_cal_disable << 0)     /**< Shifted mode cal_disable for RAC_LNAMIXCAL  */
#define RAC_LNAMIXCAL_LNAMIXCALEN_cal_enable                          (_RAC_LNAMIXCAL_LNAMIXCALEN_cal_enable << 0)      /**< Shifted mode cal_enable for RAC_LNAMIXCAL   */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE                                  (0x1UL << 1)                                      /**< LNAMIXCALVMODE                              */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_SHIFT                           1                                                 /**< Shift value for RAC_LNAMIXCALVMODE          */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_MASK                            0x2UL                                             /**< Bit mask for RAC_LNAMIXCALVMODE             */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode                    0x00000000UL                                      /**< Mode current_mode for RAC_LNAMIXCAL         */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode                    0x00000001UL                                      /**< Mode voltage_mode for RAC_LNAMIXCAL         */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT                          (_RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT << 1)      /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode                     (_RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode << 1) /**< Shifted mode current_mode for RAC_LNAMIXCAL */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode                     (_RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode << 1) /**< Shifted mode voltage_mode for RAC_LNAMIXCAL */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL                                   (0x1UL << 2)                                      /**< LNAMIXENIRCAL                               */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL_SHIFT                            2                                                 /**< Shift value for RAC_LNAMIXENIRCAL           */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL_MASK                             0x4UL                                             /**< Bit mask for RAC_LNAMIXENIRCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL_DEFAULT                          0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL_disable                          0x00000000UL                                      /**< Mode disable for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL_enable                           0x00000001UL                                      /**< Mode enable for RAC_LNAMIXCAL               */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL_DEFAULT                           (_RAC_LNAMIXCAL_LNAMIXENIRCAL_DEFAULT << 2)       /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL_disable                           (_RAC_LNAMIXCAL_LNAMIXENIRCAL_disable << 2)       /**< Shifted mode disable for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL_enable                            (_RAC_LNAMIXCAL_LNAMIXENIRCAL_enable << 2)        /**< Shifted mode enable for RAC_LNAMIXCAL       */
#define _RAC_LNAMIXCAL_LNAMIXIRCALAMP_SHIFT                           4                                                 /**< Shift value for RAC_LNAMIXIRCALAMP          */
#define _RAC_LNAMIXCAL_LNAMIXIRCALAMP_MASK                            0x70UL                                            /**< Bit mask for RAC_LNAMIXIRCALAMP             */
#define _RAC_LNAMIXCAL_LNAMIXIRCALAMP_DEFAULT                         0x00000007UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define RAC_LNAMIXCAL_LNAMIXIRCALAMP_DEFAULT                          (_RAC_LNAMIXCAL_LNAMIXIRCALAMP_DEFAULT << 4)      /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */

/* Bit fields for RAC LNAMIXEN */
#define _RAC_LNAMIXEN_RESETVALUE                                      0x00000000UL                             /**< Default value for RAC_LNAMIXEN              */
#define _RAC_LNAMIXEN_MASK                                            0x00000001UL                             /**< Mask for RAC_LNAMIXEN                       */
#define RAC_LNAMIXEN_LNAMIXENLDO                                      (0x1UL << 0)                             /**< LNAMIXENLDO                                 */
#define _RAC_LNAMIXEN_LNAMIXENLDO_SHIFT                               0                                        /**< Shift value for RAC_LNAMIXENLDO             */
#define _RAC_LNAMIXEN_LNAMIXENLDO_MASK                                0x1UL                                    /**< Bit mask for RAC_LNAMIXENLDO                */
#define _RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENLDO_disable                             0x00000000UL                             /**< Mode disable for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENLDO_enable                              0x00000001UL                             /**< Mode enable for RAC_LNAMIXEN                */
#define RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT                              (_RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENLDO_disable                              (_RAC_LNAMIXEN_LNAMIXENLDO_disable << 0) /**< Shifted mode disable for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENLDO_enable                               (_RAC_LNAMIXEN_LNAMIXENLDO_enable << 0)  /**< Shifted mode enable for RAC_LNAMIXEN        */

