SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_rac.h
/* Bit fields for RAC PATRIM0 */
#define _RAC_PATRIM0_RESETVALUE                                       0x00000077UL                                   /**< Default value for RAC_PATRIM0               */
#define _RAC_PATRIM0_MASK                                             0x00003FFFUL                                   /**< Mask for RAC_PATRIM0                        */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_SHIFT                            0                                              /**< Shift value for RAC_TX0DBMTRIMBIASN         */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_MASK                             0xFUL                                          /**< Bit mask for RAC_TX0DBMTRIMBIASN            */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_DEFAULT                          0x00000007UL                                   /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_378m                           0x00000000UL                                   /**< Mode v_378m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_392m                           0x00000001UL                                   /**< Mode v_392m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_405m                           0x00000002UL                                   /**< Mode v_405m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_418p5m                         0x00000003UL                                   /**< Mode v_418p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_431m                           0x00000004UL                                   /**< Mode v_431m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_444m                           0x00000005UL                                   /**< Mode v_444m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_457m                           0x00000006UL                                   /**< Mode v_457m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_470m                           0x00000007UL                                   /**< Mode v_470m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_483m                           0x00000008UL                                   /**< Mode v_483m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_496m                           0x00000009UL                                   /**< Mode v_496m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_509m                           0x0000000AUL                                   /**< Mode v_509m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_522m                           0x0000000BUL                                   /**< Mode v_522m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_535m                           0x0000000CUL                                   /**< Mode v_535m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_548m                           0x0000000DUL                                   /**< Mode v_548m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_561m                           0x0000000EUL                                   /**< Mode v_561m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_574m                           0x0000000FUL                                   /**< Mode v_574m for RAC_PATRIM0                 */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_DEFAULT                           (_RAC_PATRIM0_TX0DBMTRIMBIASN_DEFAULT << 0)    /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_378m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_378m << 0)     /**< Shifted mode v_378m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_392m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_392m << 0)     /**< Shifted mode v_392m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_405m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_405m << 0)     /**< Shifted mode v_405m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_418p5m                          (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_418p5m << 0)   /**< Shifted mode v_418p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_431m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_431m << 0)     /**< Shifted mode v_431m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_444m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_444m << 0)     /**< Shifted mode v_444m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_457m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_457m << 0)     /**< Shifted mode v_457m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_470m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_470m << 0)     /**< Shifted mode v_470m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_483m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_483m << 0)     /**< Shifted mode v_483m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_496m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_496m << 0)     /**< Shifted mode v_496m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_509m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_509m << 0)     /**< Shifted mode v_509m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_522m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_522m << 0)     /**< Shifted mode v_522m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_535m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_535m << 0)     /**< Shifted mode v_535m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_548m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_548m << 0)     /**< Shifted mode v_548m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_561m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_561m << 0)     /**< Shifted mode v_561m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_574m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_574m << 0)     /**< Shifted mode v_574m for RAC_PATRIM0         */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_SHIFT                            4                                              /**< Shift value for RAC_TX0DBMTRIMBIASP         */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_MASK                             0xF0UL                                         /**< Bit mask for RAC_TX0DBMTRIMBIASP            */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_DEFAULT                          0x00000007UL                                   /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_378m                           0x00000000UL                                   /**< Mode v_378m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_392m                           0x00000001UL                                   /**< Mode v_392m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_405m                           0x00000002UL                                   /**< Mode v_405m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_418p5m                         0x00000003UL                                   /**< Mode v_418p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_431m                           0x00000004UL                                   /**< Mode v_431m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_444m                           0x00000005UL                                   /**< Mode v_444m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_457m                           0x00000006UL                                   /**< Mode v_457m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_470m                           0x00000007UL                                   /**< Mode v_470m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_483m                           0x00000008UL                                   /**< Mode v_483m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_496m                           0x00000009UL                                   /**< Mode v_496m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_509m                           0x0000000AUL                                   /**< Mode v_509m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_522m                           0x0000000BUL                                   /**< Mode v_522m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_535m                           0x0000000CUL                                   /**< Mode v_535m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_548m                           0x0000000DUL                                   /**< Mode v_548m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_561m                           0x0000000EUL                                   /**< Mode v_561m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_574m                           0x0000000FUL                                   /**< Mode v_574m for RAC_PATRIM0                 */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_DEFAULT                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_DEFAULT << 4)    /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_378m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_378m << 4)     /**< Shifted mode v_378m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_392m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_392m << 4)     /**< Shifted mode v_392m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_405m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_405m << 4)     /**< Shifted mode v_405m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_418p5m                          (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_418p5m << 4)   /**< Shifted mode v_418p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_431m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_431m << 4)     /**< Shifted mode v_431m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_444m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_444m << 4)     /**< Shifted mode v_444m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_457m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_457m << 4)     /**< Shifted mode v_457m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_470m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_470m << 4)     /**< Shifted mode v_470m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_483m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_483m << 4)     /**< Shifted mode v_483m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_496m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_496m << 4)     /**< Shifted mode v_496m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_509m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_509m << 4)     /**< Shifted mode v_509m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_522m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_522m << 4)     /**< Shifted mode v_522m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_535m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_535m << 4)     /**< Shifted mode v_535m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_548m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_548m << 4)     /**< Shifted mode v_548m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_561m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_561m << 4)     /**< Shifted mode v_561m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_574m                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_574m << 4)     /**< Shifted mode v_574m for RAC_PATRIM0         */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_SHIFT                          8                                              /**< Shift value for RAC_TX0DBMTRIMDUTYCYN       */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_MASK                           0x700UL                                        /**< Bit mask for RAC_TX0DBMTRIMDUTYCYN          */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_0pct                        0x00000000UL                                   /**< Mode up_0pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_1pct                        0x00000001UL                                   /**< Mode up_1pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_2pct                        0x00000002UL                                   /**< Mode up_2pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_3pct                        0x00000003UL                                   /**< Mode up_3pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_4pct                        0x00000004UL                                   /**< Mode up_4pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_5pct                        0x00000005UL                                   /**< Mode up_5pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_6pct                        0x00000006UL                                   /**< Mode up_6pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYN_na                             0x00000007UL                                   /**< Mode na for RAC_PATRIM0                     */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_DEFAULT                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_DEFAULT << 8)  /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_0pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_0pct << 8)  /**< Shifted mode up_0pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_1pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_1pct << 8)  /**< Shifted mode up_1pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_2pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_2pct << 8)  /**< Shifted mode up_2pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_3pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_3pct << 8)  /**< Shifted mode up_3pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_4pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_4pct << 8)  /**< Shifted mode up_4pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_5pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_5pct << 8)  /**< Shifted mode up_5pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_6pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_up_6pct << 8)  /**< Shifted mode up_6pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYN_na                              (_RAC_PATRIM0_TX0DBMTRIMDUTYCYN_na << 8)       /**< Shifted mode na for RAC_PATRIM0             */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_SHIFT                          11                                             /**< Shift value for RAC_TX0DBMTRIMDUTYCYP       */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_MASK                           0x3800UL                                       /**< Bit mask for RAC_TX0DBMTRIMDUTYCYP          */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_0pct                        0x00000000UL                                   /**< Mode dn_0pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_1pct                        0x00000001UL                                   /**< Mode dn_1pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_2pct                        0x00000002UL                                   /**< Mode dn_2pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_3pct                        0x00000003UL                                   /**< Mode dn_3pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_4pct                        0x00000004UL                                   /**< Mode dn_4pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_5pct                        0x00000005UL                                   /**< Mode dn_5pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_6pct                        0x00000006UL                                   /**< Mode dn_6pct for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMDUTYCYP_na                             0x00000007UL                                   /**< Mode na for RAC_PATRIM0                     */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_DEFAULT                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_DEFAULT << 11) /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_0pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_0pct << 11) /**< Shifted mode dn_0pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_1pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_1pct << 11) /**< Shifted mode dn_1pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_2pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_2pct << 11) /**< Shifted mode dn_2pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_3pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_3pct << 11) /**< Shifted mode dn_3pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_4pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_4pct << 11) /**< Shifted mode dn_4pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_5pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_5pct << 11) /**< Shifted mode dn_5pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_6pct                         (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_dn_6pct << 11) /**< Shifted mode dn_6pct for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMDUTYCYP_na                              (_RAC_PATRIM0_TX0DBMTRIMDUTYCYP_na << 11)      /**< Shifted mode na for RAC_PATRIM0             */

