SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_rac.h
/* Bit fields for RAC PATRIM3 */
#define _RAC_PATRIM3_RESETVALUE                                       0x002E2B2AUL                                              /**< Default value for RAC_PATRIM3               */
#define _RAC_PATRIM3_MASK                                             0x007E7FFFUL                                              /**< Mask for RAC_PATRIM3                        */
#define _RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_SHIFT                      0                                                         /**< Shift value for RAC_TX6DBMTRIMIBIASMASTER   */
#define _RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_MASK                       0x3UL                                                     /**< Bit mask for RAC_TX6DBMTRIMIBIASMASTER      */
#define _RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_DEFAULT                    0x00000002UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_45u                  0x00000000UL                                              /**< Mode ibias_45u for RAC_PATRIM3              */
#define _RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_47p5u                0x00000001UL                                              /**< Mode ibias_47p5u for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_50u                  0x00000002UL                                              /**< Mode ibias_50u for RAC_PATRIM3              */
#define _RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_52p5u                0x00000003UL                                              /**< Mode ibias_52p5u for RAC_PATRIM3            */
#define RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_DEFAULT                     (_RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_45u                   (_RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_45u << 0)       /**< Shifted mode ibias_45u for RAC_PATRIM3      */
#define RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_47p5u                 (_RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_47p5u << 0)     /**< Shifted mode ibias_47p5u for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_50u                   (_RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_50u << 0)       /**< Shifted mode ibias_50u for RAC_PATRIM3      */
#define RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_52p5u                 (_RAC_PATRIM3_TX6DBMTRIMIBIASMASTER_ibias_52p5u << 0)     /**< Shifted mode ibias_52p5u for RAC_PATRIM3    */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_SHIFT                      2                                                         /**< Shift value for RAC_TX6DBMTRIMPREDRVREGFB   */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_MASK                       0xCUL                                                     /**< Bit mask for RAC_TX6DBMTRIMPREDRVREGFB      */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_DEFAULT                    0x00000002UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p63                   0x00000000UL                                              /**< Mode Acl_1p63 for RAC_PATRIM3               */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p71                   0x00000001UL                                              /**< Mode Acl_1p71 for RAC_PATRIM3               */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p80                   0x00000002UL                                              /**< Mode Acl_1p80 for RAC_PATRIM3               */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p92                   0x00000003UL                                              /**< Mode Acl_1p92 for RAC_PATRIM3               */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_DEFAULT                     (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_DEFAULT << 2)         /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p63                    (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p63 << 2)        /**< Shifted mode Acl_1p63 for RAC_PATRIM3       */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p71                    (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p71 << 2)        /**< Shifted mode Acl_1p71 for RAC_PATRIM3       */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p80                    (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p80 << 2)        /**< Shifted mode Acl_1p80 for RAC_PATRIM3       */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p92                    (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGFB_Acl_1p92 << 2)        /**< Shifted mode Acl_1p92 for RAC_PATRIM3       */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT                         (0x1UL << 4)                                              /**< TX6DBMTRIMPREDRVREGFBKATT                   */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_SHIFT                  4                                                         /**< Shift value for RAC_TX6DBMTRIMPREDRVREGFBKATT*/
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_MASK                   0x10UL                                                    /**< Bit mask for RAC_TX6DBMTRIMPREDRVREGFBKATT  */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_DEFAULT                0x00000000UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_reduce_BW              0x00000000UL                                              /**< Mode reduce_BW for RAC_PATRIM3              */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_increase_BW            0x00000001UL                                              /**< Mode increase_BW for RAC_PATRIM3            */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_DEFAULT                 (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_DEFAULT << 4)     /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_reduce_BW               (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_reduce_BW << 4)   /**< Shifted mode reduce_BW for RAC_PATRIM3      */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_increase_BW             (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGFBKATT_increase_BW << 4) /**< Shifted mode increase_BW for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR                            (0x1UL << 5)                                              /**< TX6DBMTRIMPREDRVREGPSR                      */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_SHIFT                     5                                                         /**< Shift value for RAC_TX6DBMTRIMPREDRVREGPSR  */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_MASK                      0x20UL                                                    /**< Bit mask for RAC_TX6DBMTRIMPREDRVREGPSR     */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_DEFAULT                   0x00000001UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_low_psr                   0x00000000UL                                              /**< Mode low_psr for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_high_psr                  0x00000001UL                                              /**< Mode high_psr for RAC_PATRIM3               */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_DEFAULT                    (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_DEFAULT << 5)        /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_low_psr                    (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_low_psr << 5)        /**< Shifted mode low_psr for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_high_psr                   (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGPSR_high_psr << 5)       /**< Shifted mode high_psr for RAC_PATRIM3       */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_SHIFT                   6                                                         /**< Shift value for RAC_TX6DBMTRIMPREDRVREGSLICE*/
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_MASK                    0xC0UL                                                    /**< Bit mask for RAC_TX6DBMTRIMPREDRVREGSLICE   */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_DEFAULT                 0x00000000UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_3mA               0x00000000UL                                              /**< Mode iload_3mA for RAC_PATRIM3              */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_6mA               0x00000001UL                                              /**< Mode iload_6mA for RAC_PATRIM3              */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_9mA               0x00000002UL                                              /**< Mode iload_9mA for RAC_PATRIM3              */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_12mA              0x00000003UL                                              /**< Mode iload_12mA for RAC_PATRIM3             */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_DEFAULT                  (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_3mA                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_3mA << 6)    /**< Shifted mode iload_3mA for RAC_PATRIM3      */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_6mA                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_6mA << 6)    /**< Shifted mode iload_6mA for RAC_PATRIM3      */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_9mA                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_9mA << 6)    /**< Shifted mode iload_9mA for RAC_PATRIM3      */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_12mA               (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGSLICE_iload_12mA << 6)   /**< Shifted mode iload_12mA for RAC_PATRIM3     */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_SHIFT                    8                                                         /**< Shift value for RAC_TX6DBMTRIMPREDRVREGVREF */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_MASK                     0x700UL                                                   /**< Bit mask for RAC_TX6DBMTRIMPREDRVREGVREF    */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_DEFAULT                  0x00000003UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p675               0x00000000UL                                              /**< Mode vref_0p675 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p700               0x00000001UL                                              /**< Mode vref_0p700 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p725               0x00000002UL                                              /**< Mode vref_0p725 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p750               0x00000003UL                                              /**< Mode vref_0p750 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p775               0x00000004UL                                              /**< Mode vref_0p775 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p800               0x00000005UL                                              /**< Mode vref_0p800 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p825               0x00000006UL                                              /**< Mode vref_0p825 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p850               0x00000007UL                                              /**< Mode vref_0p850 for RAC_PATRIM3             */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_DEFAULT                   (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_DEFAULT << 8)       /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p675                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p675 << 8)    /**< Shifted mode vref_0p675 for RAC_PATRIM3     */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p700                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p700 << 8)    /**< Shifted mode vref_0p700 for RAC_PATRIM3     */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p725                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p725 << 8)    /**< Shifted mode vref_0p725 for RAC_PATRIM3     */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p750                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p750 << 8)    /**< Shifted mode vref_0p750 for RAC_PATRIM3     */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p775                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p775 << 8)    /**< Shifted mode vref_0p775 for RAC_PATRIM3     */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p800                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p800 << 8)    /**< Shifted mode vref_0p800 for RAC_PATRIM3     */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p825                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p825 << 8)    /**< Shifted mode vref_0p825 for RAC_PATRIM3     */
#define RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p850                (_RAC_PATRIM3_TX6DBMTRIMPREDRVREGVREF_vref_0p850 << 8)    /**< Shifted mode vref_0p850 for RAC_PATRIM3     */
#define RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO                            (0x1UL << 11)                                             /**< TX6DBMTRIMREGBLEEDAUTO                      */
#define _RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_SHIFT                     11                                                        /**< Shift value for RAC_TX6DBMTRIMREGBLEEDAUTO  */
#define _RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_MASK                      0x800UL                                                   /**< Bit mask for RAC_TX6DBMTRIMREGBLEEDAUTO     */
#define _RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_DEFAULT                   0x00000001UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_not_automatic             0x00000000UL                                              /**< Mode not_automatic for RAC_PATRIM3          */
#define _RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_automatic                 0x00000001UL                                              /**< Mode automatic for RAC_PATRIM3              */
#define RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_DEFAULT                    (_RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_DEFAULT << 11)       /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_not_automatic              (_RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_not_automatic << 11) /**< Shifted mode not_automatic for RAC_PATRIM3  */
#define RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_automatic                  (_RAC_PATRIM3_TX6DBMTRIMREGBLEEDAUTO_automatic << 11)     /**< Shifted mode automatic for RAC_PATRIM3      */
#define _RAC_PATRIM3_TX6DBMTRIMREGFB_SHIFT                            12                                                        /**< Shift value for RAC_TX6DBMTRIMREGFB         */
#define _RAC_PATRIM3_TX6DBMTRIMREGFB_MASK                             0x3000UL                                                  /**< Bit mask for RAC_TX6DBMTRIMREGFB            */
#define _RAC_PATRIM3_TX6DBMTRIMREGFB_DEFAULT                          0x00000002UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p0x                         0x00000000UL                                              /**< Mode Acl_2p0x for RAC_PATRIM3               */
#define _RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p1x                         0x00000001UL                                              /**< Mode Acl_2p1x for RAC_PATRIM3               */
#define _RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p3125x                      0x00000002UL                                              /**< Mode Acl_2p3125x for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p5x                         0x00000003UL                                              /**< Mode Acl_2p5x for RAC_PATRIM3               */
#define RAC_PATRIM3_TX6DBMTRIMREGFB_DEFAULT                           (_RAC_PATRIM3_TX6DBMTRIMREGFB_DEFAULT << 12)              /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p0x                          (_RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p0x << 12)             /**< Shifted mode Acl_2p0x for RAC_PATRIM3       */
#define RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p1x                          (_RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p1x << 12)             /**< Shifted mode Acl_2p1x for RAC_PATRIM3       */
#define RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p3125x                       (_RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p3125x << 12)          /**< Shifted mode Acl_2p3125x for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p5x                          (_RAC_PATRIM3_TX6DBMTRIMREGFB_Acl_2p5x << 12)             /**< Shifted mode Acl_2p5x for RAC_PATRIM3       */
#define RAC_PATRIM3_TX6DBMTRIMREGPSR                                  (0x1UL << 14)                                             /**< TX6DBMTRIMREGPSR                            */
#define _RAC_PATRIM3_TX6DBMTRIMREGPSR_SHIFT                           14                                                        /**< Shift value for RAC_TX6DBMTRIMREGPSR        */
#define _RAC_PATRIM3_TX6DBMTRIMREGPSR_MASK                            0x4000UL                                                  /**< Bit mask for RAC_TX6DBMTRIMREGPSR           */
#define _RAC_PATRIM3_TX6DBMTRIMREGPSR_DEFAULT                         0x00000000UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMREGPSR_low_PSR                         0x00000000UL                                              /**< Mode low_PSR for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMREGPSR_high_PSR                        0x00000001UL                                              /**< Mode high_PSR for RAC_PATRIM3               */
#define RAC_PATRIM3_TX6DBMTRIMREGPSR_DEFAULT                          (_RAC_PATRIM3_TX6DBMTRIMREGPSR_DEFAULT << 14)             /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMREGPSR_low_PSR                          (_RAC_PATRIM3_TX6DBMTRIMREGPSR_low_PSR << 14)             /**< Shifted mode low_PSR for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMREGPSR_high_PSR                         (_RAC_PATRIM3_TX6DBMTRIMREGPSR_high_PSR << 14)            /**< Shifted mode high_PSR for RAC_PATRIM3       */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_SHIFT                          17                                                        /**< Shift value for RAC_TX6DBMTRIMREGVREF       */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_MASK                           0x1E0000UL                                                /**< Bit mask for RAC_TX6DBMTRIMREGVREF          */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_DEFAULT                        0x00000007UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6000                    0x00000000UL                                              /**< Mode vref_0p6000 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6125                    0x00000001UL                                              /**< Mode vref_0p6125 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6250                    0x00000002UL                                              /**< Mode vref_0p6250 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6375                    0x00000003UL                                              /**< Mode vref_0p6375 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6500                    0x00000004UL                                              /**< Mode vref_0p6500 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6625                    0x00000005UL                                              /**< Mode vref_0p6625 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6750                    0x00000006UL                                              /**< Mode vref_0p6750 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6875                    0x00000007UL                                              /**< Mode vref_0p6875 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7000                    0x00000008UL                                              /**< Mode vref_0p7000 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7125                    0x00000009UL                                              /**< Mode vref_0p7125 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7250                    0x0000000AUL                                              /**< Mode vref_0p7250 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7375                    0x0000000BUL                                              /**< Mode vref_0p7375 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7500                    0x0000000CUL                                              /**< Mode vref_0p7500 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7625                    0x0000000DUL                                              /**< Mode vref_0p7625 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7750                    0x0000000EUL                                              /**< Mode vref_0p7750 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7875                    0x0000000FUL                                              /**< Mode vref_0p7875 for RAC_PATRIM3            */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_DEFAULT                         (_RAC_PATRIM3_TX6DBMTRIMREGVREF_DEFAULT << 17)            /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6000                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6000 << 17)        /**< Shifted mode vref_0p6000 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6125                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6125 << 17)        /**< Shifted mode vref_0p6125 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6250                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6250 << 17)        /**< Shifted mode vref_0p6250 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6375                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6375 << 17)        /**< Shifted mode vref_0p6375 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6500                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6500 << 17)        /**< Shifted mode vref_0p6500 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6625                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6625 << 17)        /**< Shifted mode vref_0p6625 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6750                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6750 << 17)        /**< Shifted mode vref_0p6750 for RAC_PATRIM3    */
