SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_rac.h
/* Bit fields for RAC XORETIMESTATUS */
#define _RAC_XORETIMESTATUS_RESETVALUE                                0x00000000UL                                              /**< Default value for RAC_XORETIMESTATUS        */
#define _RAC_XORETIMESTATUS_MASK                                      0x00000003UL                                              /**< Mask for RAC_XORETIMESTATUS                 */
#define RAC_XORETIMESTATUS_XORETIMECLKSEL                             (0x1UL << 0)                                              /**< XORETIMECLKSEL                              */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_SHIFT                      0                                                         /**< Shift value for RAC_XORETIMECLKSEL          */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_MASK                       0x1UL                                                     /**< Bit mask for RAC_XORETIMECLKSEL             */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_DEFAULT                    0x00000000UL                                              /**< Mode DEFAULT for RAC_XORETIMESTATUS         */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_use_raw_clk                0x00000000UL                                              /**< Mode use_raw_clk for RAC_XORETIMESTATUS     */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_use_retimed_clk            0x00000001UL                                              /**< Mode use_retimed_clk for RAC_XORETIMESTATUS */
#define RAC_XORETIMESTATUS_XORETIMECLKSEL_DEFAULT                     (_RAC_XORETIMESTATUS_XORETIMECLKSEL_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_XORETIMESTATUS */
#define RAC_XORETIMESTATUS_XORETIMECLKSEL_use_raw_clk                 (_RAC_XORETIMESTATUS_XORETIMECLKSEL_use_raw_clk << 0)     /**< Shifted mode use_raw_clk for RAC_XORETIMESTATUS*/
#define RAC_XORETIMESTATUS_XORETIMECLKSEL_use_retimed_clk             (_RAC_XORETIMESTATUS_XORETIMECLKSEL_use_retimed_clk << 0) /**< Shifted mode use_retimed_clk for RAC_XORETIMESTATUS*/
#define RAC_XORETIMESTATUS_XORETIMERESETNLO                           (0x1UL << 1)                                              /**< XORETIMERESETNLO                            */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_SHIFT                    1                                                         /**< Shift value for RAC_XORETIMERESETNLO        */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_MASK                     0x2UL                                                     /**< Bit mask for RAC_XORETIMERESETNLO           */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_DEFAULT                  0x00000000UL                                              /**< Mode DEFAULT for RAC_XORETIMESTATUS         */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_lo                       0x00000000UL                                              /**< Mode lo for RAC_XORETIMESTATUS              */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_hi                       0x00000001UL                                              /**< Mode hi for RAC_XORETIMESTATUS              */
#define RAC_XORETIMESTATUS_XORETIMERESETNLO_DEFAULT                   (_RAC_XORETIMESTATUS_XORETIMERESETNLO_DEFAULT << 1)       /**< Shifted mode DEFAULT for RAC_XORETIMESTATUS */
#define RAC_XORETIMESTATUS_XORETIMERESETNLO_lo                        (_RAC_XORETIMESTATUS_XORETIMERESETNLO_lo << 1)            /**< Shifted mode lo for RAC_XORETIMESTATUS      */
#define RAC_XORETIMESTATUS_XORETIMERESETNLO_hi                        (_RAC_XORETIMESTATUS_XORETIMERESETNLO_hi << 1)            /**< Shifted mode hi for RAC_XORETIMESTATUS      */

/* Bit fields for RAC XOSQBUFFILT */
#define _RAC_XOSQBUFFILT_RESETVALUE                                   0x00000000UL                                 /**< Default value for RAC_XOSQBUFFILT           */
#define _RAC_XOSQBUFFILT_MASK                                         0x00000003UL                                 /**< Mask for RAC_XOSQBUFFILT                    */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_SHIFT                            0                                            /**< Shift value for RAC_XOSQBUFFILT             */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_MASK                             0x3UL                                        /**< Bit mask for RAC_XOSQBUFFILT                */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_DEFAULT                          0x00000000UL                                 /**< Mode DEFAULT for RAC_XOSQBUFFILT            */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_bypass                           0x00000000UL                                 /**< Mode bypass for RAC_XOSQBUFFILT             */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_filter_1                         0x00000001UL                                 /**< Mode filter_1 for RAC_XOSQBUFFILT           */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_filter_2                         0x00000002UL                                 /**< Mode filter_2 for RAC_XOSQBUFFILT           */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_filter_3                         0x00000003UL                                 /**< Mode filter_3 for RAC_XOSQBUFFILT           */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_DEFAULT                           (_RAC_XOSQBUFFILT_XOSQBUFFILT_DEFAULT << 0)  /**< Shifted mode DEFAULT for RAC_XOSQBUFFILT    */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_bypass                            (_RAC_XOSQBUFFILT_XOSQBUFFILT_bypass << 0)   /**< Shifted mode bypass for RAC_XOSQBUFFILT     */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_filter_1                          (_RAC_XOSQBUFFILT_XOSQBUFFILT_filter_1 << 0) /**< Shifted mode filter_1 for RAC_XOSQBUFFILT   */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_filter_2                          (_RAC_XOSQBUFFILT_XOSQBUFFILT_filter_2 << 0) /**< Shifted mode filter_2 for RAC_XOSQBUFFILT   */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_filter_3                          (_RAC_XOSQBUFFILT_XOSQBUFFILT_filter_3 << 0) /**< Shifted mode filter_3 for RAC_XOSQBUFFILT   */

/* Bit fields for RAC AGCOVERWRITE */
#define _RAC_AGCOVERWRITE_RESETVALUE                                  0x00000000UL                                      /**< Default value for RAC_AGCOVERWRITE          */
#define _RAC_AGCOVERWRITE_MASK                                        0x03F0FFFFUL                                      /**< Mask for RAC_AGCOVERWRITE                   */
#define RAC_AGCOVERWRITE_ENMANLNAMIXRFATT                             (0x1UL << 0)                                      /**< Enable RAC Overwite PN                      */
#define _RAC_AGCOVERWRITE_ENMANLNAMIXRFATT_SHIFT                      0                                                 /**< Shift value for RAC_ENMANLNAMIXRFATT        */
#define _RAC_AGCOVERWRITE_ENMANLNAMIXRFATT_MASK                       0x1UL                                             /**< Bit mask for RAC_ENMANLNAMIXRFATT           */
#define _RAC_AGCOVERWRITE_ENMANLNAMIXRFATT_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for RAC_AGCOVERWRITE           */
#define RAC_AGCOVERWRITE_ENMANLNAMIXRFATT_DEFAULT                     (_RAC_AGCOVERWRITE_ENMANLNAMIXRFATT_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE   */
#define RAC_AGCOVERWRITE_ENMANLNAMIXSLICE                             (0x1UL << 1)                                      /**< Enable RAC Overwite LNA                     */
#define _RAC_AGCOVERWRITE_ENMANLNAMIXSLICE_SHIFT                      1                                                 /**< Shift value for RAC_ENMANLNAMIXSLICE        */
#define _RAC_AGCOVERWRITE_ENMANLNAMIXSLICE_MASK                       0x2UL                                             /**< Bit mask for RAC_ENMANLNAMIXSLICE           */
#define _RAC_AGCOVERWRITE_ENMANLNAMIXSLICE_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for RAC_AGCOVERWRITE           */
#define RAC_AGCOVERWRITE_ENMANLNAMIXSLICE_DEFAULT                     (_RAC_AGCOVERWRITE_ENMANLNAMIXSLICE_DEFAULT << 1) /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE   */
#define RAC_AGCOVERWRITE_ENMANPGAGAIN                                 (0x1UL << 2)                                      /**< Enable RAC Overwite PGA                     */
#define _RAC_AGCOVERWRITE_ENMANPGAGAIN_SHIFT                          2                                                 /**< Shift value for RAC_ENMANPGAGAIN            */
#define _RAC_AGCOVERWRITE_ENMANPGAGAIN_MASK                           0x4UL                                             /**< Bit mask for RAC_ENMANPGAGAIN               */
#define _RAC_AGCOVERWRITE_ENMANPGAGAIN_DEFAULT                        0x00000000UL                                      /**< Mode DEFAULT for RAC_AGCOVERWRITE           */
#define RAC_AGCOVERWRITE_ENMANPGAGAIN_DEFAULT                         (_RAC_AGCOVERWRITE_ENMANPGAGAIN_DEFAULT << 2)     /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE   */
#define RAC_AGCOVERWRITE_ENMANIFADCSCALE                              (0x1UL << 3)                                      /**< Enable RAC Overwite PN                      */
#define _RAC_AGCOVERWRITE_ENMANIFADCSCALE_SHIFT                       3                                                 /**< Shift value for RAC_ENMANIFADCSCALE         */
#define _RAC_AGCOVERWRITE_ENMANIFADCSCALE_MASK                        0x8UL                                             /**< Bit mask for RAC_ENMANIFADCSCALE            */
#define _RAC_AGCOVERWRITE_ENMANIFADCSCALE_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for RAC_AGCOVERWRITE           */
#define RAC_AGCOVERWRITE_ENMANIFADCSCALE_DEFAULT                      (_RAC_AGCOVERWRITE_ENMANIFADCSCALE_DEFAULT << 3)  /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE   */
#define _RAC_AGCOVERWRITE_MANLNAMIXRFATT_SHIFT                        4                                                 /**< Shift value for RAC_MANLNAMIXRFATT          */
#define _RAC_AGCOVERWRITE_MANLNAMIXRFATT_MASK                         0x3F0UL                                           /**< Bit mask for RAC_MANLNAMIXRFATT             */
#define _RAC_AGCOVERWRITE_MANLNAMIXRFATT_DEFAULT                      0x00000000UL                                      /**< Mode DEFAULT for RAC_AGCOVERWRITE           */
#define RAC_AGCOVERWRITE_MANLNAMIXRFATT_DEFAULT                       (_RAC_AGCOVERWRITE_MANLNAMIXRFATT_DEFAULT << 4)   /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE   */
#define _RAC_AGCOVERWRITE_MANLNAMIXSLICE_SHIFT                        10                                                /**< Shift value for RAC_MANLNAMIXSLICE          */
#define _RAC_AGCOVERWRITE_MANLNAMIXSLICE_MASK                         0xFC00UL                                          /**< Bit mask for RAC_MANLNAMIXSLICE             */
#define _RAC_AGCOVERWRITE_MANLNAMIXSLICE_DEFAULT                      0x00000000UL                                      /**< Mode DEFAULT for RAC_AGCOVERWRITE           */
#define RAC_AGCOVERWRITE_MANLNAMIXSLICE_DEFAULT                       (_RAC_AGCOVERWRITE_MANLNAMIXSLICE_DEFAULT << 10)  /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE   */
#define _RAC_AGCOVERWRITE_MANPGAGAIN_SHIFT                            20                                                /**< Shift value for RAC_MANPGAGAIN              */
#define _RAC_AGCOVERWRITE_MANPGAGAIN_MASK                             0xF00000UL                                        /**< Bit mask for RAC_MANPGAGAIN                 */
#define _RAC_AGCOVERWRITE_MANPGAGAIN_DEFAULT                          0x00000000UL                                      /**< Mode DEFAULT for RAC_AGCOVERWRITE           */
#define RAC_AGCOVERWRITE_MANPGAGAIN_DEFAULT                           (_RAC_AGCOVERWRITE_MANPGAGAIN_DEFAULT << 20)      /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE   */
#define _RAC_AGCOVERWRITE_MANIFADCSCALE_SHIFT                         24                                                /**< Shift value for RAC_MANIFADCSCALE           */
#define _RAC_AGCOVERWRITE_MANIFADCSCALE_MASK                          0x3000000UL                                       /**< Bit mask for RAC_MANIFADCSCALE              */
#define _RAC_AGCOVERWRITE_MANIFADCSCALE_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for RAC_AGCOVERWRITE           */
#define RAC_AGCOVERWRITE_MANIFADCSCALE_DEFAULT                        (_RAC_AGCOVERWRITE_MANIFADCSCALE_DEFAULT << 24)   /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE   */

/* Bit fields for RAC SCRATCH0 */
#define _RAC_SCRATCH0_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_SCRATCH0              */
#define _RAC_SCRATCH0_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH0                       */
#define _RAC_SCRATCH0_SCRATCH0_SHIFT                                  0                                     /**< Shift value for RAC_SCRATCH0                */
#define _RAC_SCRATCH0_SCRATCH0_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH0                   */
#define _RAC_SCRATCH0_SCRATCH0_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH0               */
#define RAC_SCRATCH0_SCRATCH0_DEFAULT                                 (_RAC_SCRATCH0_SCRATCH0_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH0       */

/* Bit fields for RAC SCRATCH1 */
#define _RAC_SCRATCH1_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_SCRATCH1              */
#define _RAC_SCRATCH1_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH1                       */
#define _RAC_SCRATCH1_SCRATCH1_SHIFT                                  0                                     /**< Shift value for RAC_SCRATCH1                */
#define _RAC_SCRATCH1_SCRATCH1_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH1                   */
#define _RAC_SCRATCH1_SCRATCH1_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH1               */
#define RAC_SCRATCH1_SCRATCH1_DEFAULT                                 (_RAC_SCRATCH1_SCRATCH1_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH1       */

